INSERT INTO user (id)
VALUES (1),
       (2);

INSERT INTO service (id, parent_id, name)
VALUES (1, NULL, 'Строительство'),
       (2, 1, 'Кладка кирпича/блока'),
       (3, 1, 'Монтаж окон'),
       (4, NULL, 'Транспорт/перевозки'),
       (5, 4, 'Спецтехника'),
       (6, 5, 'Услуги манипулятора');

INSERT INTO offer (title, description, user_id, service_id)
VALUES ('Установка плит', '5 плит, высота 4 м', 1, 6),
       ('Предложение_2', 'Описание_2', 2, 3),
       ('Предложение_3', 'Описание_3', 2, 5),
       ('Предложение_4', 'Описание_4', 1, 4);
